app/controllers/comments_controller.rb

SELECT * FROM "comments"
---
  def index
    @comments = Comment.all

SELECT * FROM "comments" WHERE ("comments"."id" = 1)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM "comments" WHERE ("comments"."id" = 6)
---
  def edit
    @comment = Comment.find(params[:id])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 39)
INSERT INTO "comments" ("name", "meeting_id", "created_at", "body", "updated_at", "subject", "email") VALUES('charles', 39, '2009-11-06 23:12:16', 'kdjfladl
---
  def create
    @meeting = Meeting.find(params[:meeting_id])
    @comment = @meeting.comments.build(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM "comments" WHERE ("comments"."id" = 6)
UPDATE "comments" SET "updated_at" = '2009-11-06 23:16:15', "body" = 'AAAAAAAAAAAAAA
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])