app/controllers/meetings_controller.rb

SELECT * FROM "meetings" WHERE (title LIKE '%aaaaaa%') ORDER BY created_at DESC LIMIT 1 OFFSET 0
---
  def find_meeting
    setup_enclosing_resources
    @meeting = Meeting.find(params[:id])

SELECT * FROM "meetings" ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "meetings" WHERE (title LIKE '%aaaaaa%')
---
  def find_meetings
    setup_enclosing_resources
    search = params[:search]

    if search.blank?
      @meetings = Meeting.paginate :per_page => 1, :page => params[:page], :order => 'created_at DESC'

INSERT INTO "meetings" ("num_days_forward_to_consider", "created_at", "title", "updated_at", "num_days_before_scheduling", "number_of_people_who_need_to_respond_before_suggesting_a_date", "tentative_days") VALUES(33, '2009-10-19 19:21:39', '', '2009-10-19 19:21:39', NULL, NULL, '')
---
  def create

    @initial_days = @meeting.calc_tentative_days()
    #    @meeting.tentative_days =  @initial_days.join(" ")

    respond_to do |format|
      if @meeting.save