app/controllers/participants_controller.rb

SELECT * FROM "participants" WHERE ("participants".meeting_id = 19) AND ("participants".meeting_id = 19)
---
  def find_participant
    setup_enclosing_resources
    @participant = @meeting.participants.find(params[:id])

SELECT * FROM "meetings" WHERE ("meetings"."id" = 2)
INSERT INTO "participants" ("name", "meeting_id", "created_at", "updated_at", "collection_of_unavailable_days") VALUES('ONly avaiable on the 2nd', 21, '2009-10-31 21:16:10', '2009-10-31 21:16:10', '---
UPDATE "meetings" SET "updated_at" = '2009-10-19 21:56:13', "tentative_days" = '10/23 10/26 10/27 10/28 10/29 10/30 11/13 11/16 11/17 11/18 11/19 11/20 11/23' WHERE "id" = 10
---
  def create
    @meeting = @participant.meeting
    @all_tentative_days = @meeting.calc_tentative_days
    @previous_current_unavailable_days = @meeting.calc_current_unavailable_days
    @collection_of_unavailable_days = @participant.collection_of_unavailable_days.split
    @all_current_unavailable_days = @previous_current_unavailable_days + @collection_of_unavailable_days
    @tentative_days = @all_tentative_days - @all_current_unavailable_days
    @participant.meeting.tentative_days = @tentative_days.join(' ')
    respond_to do |format|
      if @participant.save && @participant.meeting.save

SELECT * FROM "meetings" ORDER BY meetings.id DESC LIMIT 1
UPDATE "meetings" SET "updated_at" = '2009-10-23 15:15:58', "tentative_days" = '10/29 10/30 11/02 11/03 11/04 11/05 11/06 11/09 11/10 11/11 11/12 11/13 11/16 11/17 11/18 11/19 11/20 11/23 11/24 11/25 11/26 11/27 11/30 12/01 12/02 12/03 12/04' WHERE "id" = 16
UPDATE "participants" SET "updated_at" = '2009-10-22 11:31:09', "collection_of_unavailable_days" = ' 11/01' WHERE "id" = 15
---
  def update
    @meeting = @participant.meeting
    @calendar_subset = @meeting.calc_tentative_days
    @previous_current_unavailable_days = @meeting.calc_current_unavailable_days_sans(@participant)
#    @collection_of_unavailable_days = @participant.collection_of_unavailable_days.split
    @collection_of_unavailable_days = params[:participant][:collection_of_unavailable_days].split
    @all_current_unavailable_days = @previous_current_unavailable_days + @collection_of_unavailable_days
    @tentative_days = @calendar_subset - @all_current_unavailable_days
    @participant.meeting.tentative_days = @tentative_days.join(' ')

    respond_to do |format|
      if @participant.update_attributes(params[:participant]) && @participant.meeting.save